<a href="https://colab.research.google.com/github/zzhining/ml_basic/blob/main/pandas/exercise/%EA%B5%AC%EC%A1%B0_%EB%B3%80%EA%B2%BD.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

data = {
    'Date': ['2024-01-01', '2024-01-01', '2024-01-01', '2024-01-02', '2024-01-02', '2024-01-02',
            '2024-01-03', '2024-01-03', '2024-01-03', '2024-01-04', '2024-01-04', '2024-01-04'],
    'Company': ['A', 'B', 'C', 'A', 'B', 'C', 'A', 'B', 'C', 'A', 'B', 'C'],
    'Close': [100, 150, 200, 110, 160, 210, 105, 155, 205, 115, 165, 215],
    'Volume': [1000, 1500, 2000, 1100, 1600, 2100, 1050, 1550, 2050, 1150, 1650, 2150]
}

df = pd.DataFrame(data)
df

          Date Company  Close  Volume
0   2024-01-01       A    100    1000
1   2024-01-01       B    150    1500
2   2024-01-01       C    200    2000
3   2024-01-02       A    110    1100
4   2024-01-02       B    160    1600
5   2024-01-02       C    210    2100
6   2024-01-03       A    105    1050
7   2024-01-03       B    155    1550
8   2024-01-03       C    205    2050
9   2024-01-04       A    115    1150
10  2024-01-04       B    165    1650
11  2024-01-04       C    215    2150

1. 각 회사별 평균 종가('Close')를 계산하세요.

In [69]:
# 답을 작성하세요.
answer1 = df.groupby('Company')['Close'].mean()

In [70]:
# 테스트
print(answer1)

Company
A    107.5
B    157.5
C    207.5
Name: Close, dtype: float64

2. 각 회사별 전체 기간 동안의 총 거래량('Volume')을 계산하세요.

In [71]:
# 답을 작성하세요.
answer2 =df.groupby('Company')['Volume'].sum()

In [72]:
# 테스트
print(answer2)

Company
A    4300
B    6300
C    8300
Name: Volume, dtype: int64

3. 각 날짜별 총 거래량('Volume')을 계산하세요.

In [73]:
# 답을 작성하세요.
answer3 = df.groupby('Date')['Volume'].sum()

In [74]:
# 테스트
print(answer3)

Date
2024-01-01    4500
2024-01-02    4800
2024-01-03    4650
2024-01-04    4950
Name: Volume, dtype: int64

4. 피봇(pivot) 테이블을 사용하여 날짜별 회사의 평균 종가를 계산하세요.

In [79]:
# 답을 작성하세요.
answer4 = df.pivot_table(columns='Company', index='Date', values = 'Close', aggfunc='mean')
answer4

Company         A      B      C
Date
2024-01-01  100.0  150.0  200.0
2024-01-02  110.0  160.0  210.0
2024-01-03  105.0  155.0  205.0
2024-01-04  115.0  165.0  215.0

5. 다음 피벗 테이블을 다음과 같은 형태로 복구하세요.

|-|Date|Company|Close|
|---|---|---|---|
|0 |2024-01-01|A|100|
|1 |2024-01-02|A|110|
|2 |2024-01-03|A|105|
|3 |2024-01-04|A|115|
|4 |2024-01-01|B|150|
|5 |2024-01-02|B|160|
|6 |2024-01-03|B|155|
|7 |2024-01-04|B|165|
|8 |2024-01-01|C|200|
|9 |2024-01-02|C|210|
|10|2024-01-03|C|205|
|11|2024-01-04|C|215|

In [90]:
answer4.reset_index(inplace=True)
answer4

Company        Date      A      B      C
0        2024-01-01  100.0  150.0  200.0
1        2024-01-02  110.0  160.0  210.0
2        2024-01-03  105.0  155.0  205.0
3        2024-01-04  115.0  165.0  215.0

In [91]:
# 답을 작성하세요.

answer5 = answer4.melt(id_vars='Date', var_name='Company', value_name='Close')
answer5

          Date Company  Close
0   2024-01-01       A  100.0
1   2024-01-02       A  110.0
2   2024-01-03       A  105.0
3   2024-01-04       A  115.0
4   2024-01-01       B  150.0
5   2024-01-02       B  160.0
6   2024-01-03       B  155.0
7   2024-01-04       B  165.0
8   2024-01-01       C  200.0
9   2024-01-02       C  210.0
10  2024-01-03       C  205.0
11  2024-01-04       C  215.0

6. 각 회사별 일별 종가 변동(최대 종가 - 최소 종가)을 계산하세요.

In [98]:
import numpy as np

In [113]:
# 답을 작성하세요.
answer6 = df.groupby(['Company','Date'])['Close'].agg([np.max, np.min])
answer6['Variance'] = answer6['max'] - answer6['min']
answer6

C:\Users\selina\AppData\Local\Temp\ipykernel_20548\3491499530.py:2: FutureWarning: The provided callable <function max at 0x000001BD1E24C360> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  answer6 = df.groupby(['Company','Date'])['Close'].agg([np.max, np.min])
C:\Users\selina\AppData\Local\Temp\ipykernel_20548\3491499530.py:2: FutureWarning: The provided callable <function min at 0x000001BD1E24C4A0> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  answer6 = df.groupby(['Company','Date'])['Close'].agg([np.max, np.min])

                    max  min  Variance
Company Date
A       2024-01-01  100  100         0
        2024-01-02  110  110         0
        2024-01-03  105  105         0
        2024-01-04  115  115         0
B       2024-01-01  150  150         0
        2024-01-02  160  160         0
        2024-01-03  155  155         0
        2024-01-04  165  165         0
C       2024-01-01  200  200         0
        2024-01-02  210  210         0
        2024-01-03  205  205         0
        2024-01-04  215  215         0

7. 각 회사별 거래량 합계가 5000 이상인 회사만 선택하세요.

In [128]:
# 답을 작성하세요.
answer7 =df.groupby('Company')['Volume'].sum() 
answer7[answer7>=5000]
answer7

Company
A    4300
B    6300
C    8300
Name: Volume, dtype: int64